LiteOS/LiteOS/targets/Standard_NRF52840_PDK/Drivers/nRF_Drivers/Src/nrf_drv_usbd.c
            uint32_t data_addr; /* The address used for transmission */
            size_t size = p_transfer->size;

            if(NRF_USBD_EPIN_CHECK(ep))
            {
                if(NRF_USBD_EPISO_CHECK(ep))
                {
                    /* Isochronous endpoints supports only one transfer per frame
                     * and have to fit in the buffer */
                    ASSERT(size <= usbd_ep_iso_capacity(ep));
                }
                else
                {
                    /* Bulk transfers can be split to multiple transfers */
                    uint16_t max_packet_size = nrf_drv_usbd_ep_max_packet_size_get(ep);
                    if(size > max_packet_size)
                    {
                        size = max_packet_size;
                    }
                }
            }
            else
            {
                /* Host -> Device */
                if(size != 0)
                {
                    ASSERT(nrf_drv_is_in_RAM((const void*)(p_transfer->p_data.ptr)));
                    uint16_t rx_size = nrf_drv_usbd_epout_size_get(ep);
                    if(rx_size > size)
                    {
                        ep_state_access(ep)->status = NRF_USBD_EP_OVERLOAD;
                        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<pos)));
                        /* Error - cannot fit endpoint data into buffer */

                        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OVERLOAD);
                        m_event_handler(&evt);
                        /* This endpoint would not be transmitted now, repeat the loop */
                        continue;
                    }
                    size = rx_size;
                }
            }

            if(0 == size)
            {
                data_addr = 0;
            }
            else if(nrf_drv_is_in_RAM((const void*)(p_transfer->p_data.ptr)))
            {
                data_addr = p_transfer->p_data.ptr;
            }
            else
            {
                /* Size of FLASH transfer is limited to the buffer size - this is also the limit for ISO endpoint */
                ASSERT(size <= sizeof(m_tx_buffer));
                /* Only IN endpoints supports FLASH transfers */
                ASSERT(NRF_USBD_EPIN_CHECK(ep));
                /* Copy data into internal buffer */
                data_addr = (uint32_t)m_tx_buffer;
                memcpy(m_tx_buffer, (const void *)(p_transfer->p_data.ptr), size);
            }

            m_dma_pending = 1;
            m_ep_ready &= ~(1U << pos);

            NRF_LOG_DEBUG("USB dma process: Starting transfer on EP: %x, size: %u\r\n", ep, size);

            nrf_usbd_ep_easydma_set(ep, data_addr, size);
#if NRF_DRV_USBD_PROTO1_FIX
            uint32_t cnt_end = (uint32_t)(-1);
            do
            {
                uint32_t cnt = (uint32_t)(-1);
                do
                {
                    nrf_usbd_event_clear(NRF_USBD_EVENT_STARTED);
                    usbd_dma_start(ep);
                    nrf_drv_systick_delay_us(2);
                    ++cnt;
                }while(!nrf_usbd_event_check(NRF_USBD_EVENT_STARTED));
                if(cnt)
                {
                    NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA restarted: %u times\r\n", cnt);
                }

                nrf_drv_systick_delay_us(20);
                while(0 == (0x20 & *((volatile uint32_t *)(NRF_USBD_BASE + 0x474))))
                {
                    nrf_drv_systick_delay_us(2);
                }
                nrf_drv_systick_delay_us(1);

                ++cnt_end;
            } while(!nrf_usbd_event_check(nrf_drv_usbd_ep_to_endevent(ep)));
            if(cnt_end)
            {
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA full restarted: %u times\r\n", cnt_end);
            }
#else
            usbd_dma_start(ep);
#endif

            /* Prepare next transfer */
            p_transfer->p_data.ptr += size;
            p_transfer->size       -= size;

            /* Transfer started - exit the loop */
            break;
        }
    }
}
/** @} */

typedef void (*nrf_drv_usbd_isr_t)(void);

/**
 * @brief USBD interrupt service runtimes
 *
 */
static const nrf_drv_usbd_isr_t m_isr[] =
{
    [USBD_INTEN_USBRESET_Pos   ] = USBD_ISR_Usbreset,
    [USBD_INTEN_STARTED_Pos    ] = USBD_ISR_Started,
    [USBD_INTEN_ENDEPIN0_Pos   ] = USBD_ISR_dma_epin0,
    [USBD_INTEN_ENDEPIN1_Pos   ] = USBD_ISR_dma_epin1,
    [USBD_INTEN_ENDEPIN2_Pos   ] = USBD_ISR_dma_epin2,
    [USBD_INTEN_ENDEPIN3_Pos   ] = USBD_ISR_dma_epin3,
    [USBD_INTEN_ENDEPIN4_Pos   ] = USBD_ISR_dma_epin4,
    [USBD_INTEN_ENDEPIN5_Pos   ] = USBD_ISR_dma_epin5,
    [USBD_INTEN_ENDEPIN6_Pos   ] = USBD_ISR_dma_epin6,
    [USBD_INTEN_ENDEPIN7_Pos   ] = USBD_ISR_dma_epin7,
    [USBD_INTEN_EP0DATADONE_Pos] = USBD_ISR_SetupData,
    [USBD_INTEN_ENDISOIN_Pos   ] = USBD_ISR_dma_epin8,
    [USBD_INTEN_ENDEPOUT0_Pos  ] = USBD_ISR_dma_epout0,
    [USBD_INTEN_ENDEPOUT1_Pos  ] = USBD_ISR_dma_epout1,
    [USBD_INTEN_ENDEPOUT2_Pos  ] = USBD_ISR_dma_epout2,
    [USBD_INTEN_ENDEPOUT3_Pos  ] = USBD_ISR_dma_epout3,
    [USBD_INTEN_ENDEPOUT4_Pos  ] = USBD_ISR_dma_epout4,
    [USBD_INTEN_ENDEPOUT5_Pos  ] = USBD_ISR_dma_epout5,
    [USBD_INTEN_ENDEPOUT6_Pos  ] = USBD_ISR_dma_epout6,
    [USBD_INTEN_ENDEPOUT7_Pos  ] = USBD_ISR_dma_epout7,
    [USBD_INTEN_ENDISOOUT_Pos  ] = USBD_ISR_dma_epout8,
    [USBD_INTEN_SOF_Pos        ] = USBD_ISR_Sof,
    [USBD_INTEN_USBEVENT_Pos   ] = USBD_ISR_Event,
    [USBD_INTEN_EP0SETUP_Pos   ] = USBD_ISR_Setup,
    [USBD_INTEN_EPDATA_Pos     ] = USBD_ISR_EpDataStatus,
    [USBD_INTEN_ACCESSFAULT_Pos] = USBD_ISR_AccessFault
};

/**
 * @name Interrupt handlers
 *
 * @{
 */
void USBD_IRQHandler(void)
{
    const uint32_t enabled = nrf_usbd_int_enable_get();
    uint32_t to_process = enabled;
    uint32_t active = 0;

    /* Check all enabled interrupts */
    while(to_process)
    {
        uint8_t event_nr = __CLZ(__RBIT(to_process));
        if(nrf_usbd_event_get_and_clear((nrf_usbd_event_t)nrf_drv_bitpos_to_event(event_nr)))
        {
            active |= 1UL << event_nr;
        }
        to_process &= ~(1UL << event_nr);
    }

#if NRF_DRV_USBD_PROTO1_FIX
    do {
        active |= enabled & m_simulated_events;
        m_simulated_events = 0;
#endif
#if NRF_DRV_USBD_PROTO1_FIX
    /* Event correcting */
    if((0 == m_dma_pending) && (0 != (active & (USBD_INTEN_SOF_Msk))))
    {
        uint8_t usbi, uoi, uii;
        /* Testing */
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
        uii = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        if(0 != uii)
        {
            uii &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        }

        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
        uoi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        if(0 != uoi)
        {
            uoi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        }
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
        usbi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        if(0 != usbi)
        {
            usbi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        }
        /* Processing */
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AC;
        uii &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
        if(0 != uii)
        {
            uint8_t rb;
            m_simulated_dataepstatus |= ((uint32_t)uii)<<USBD_EPIN_BITPOS_0;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uii;
            rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            UNUSED_VARIABLE(rb);
            NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uii: 0x%.2x (0x%.2x)\r\n", uii, rb);
        }

