LiteOS/LiteOS/targets/Standard_NRF52840_PDK/Drivers/nRF_Drivers/Src/nrf_drv_usbd.c
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AD;
        uoi &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
        if(0 != uoi)
        {
            uint8_t rb;
            m_simulated_dataepstatus |= ((uint32_t)uoi)<<USBD_EPOUT_BITPOS_0;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uoi;
            rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            UNUSED_VARIABLE(rb);
            NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uoi: 0x%.2u (0x%.2x)\r\n", uoi, rb);
        }

        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AE;
        usbi &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
        if(0 != usbi)
        {
            uint8_t rb;
            if(usbi & 0x01)
            {
                active |= USBD_INTEN_EP0SETUP_Msk;;
            }
            if(usbi & 0x10)
            {
                active |= USBD_INTEN_USBRESET_Msk;
            }
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = usbi;
            rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            UNUSED_VARIABLE(rb);
            NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   usbi: 0x%.2u (0x%.2x)\r\n", usbi, rb);
        }
        if(0 != m_simulated_dataepstatus)
        {
            active |= enabled & NRF_USBD_INT_DATAEP_MASK;
        }
    }
#endif

    /* Process active interrupts */
    while(active)
    {
        uint8_t event_nr = __CLZ(__RBIT(active));
        #if 0
        /* Move SetupData priority after DMA priority */
        if(USBD_INTEN_EP0DATADONE_Pos == event_nr)
        {
            uint32_t active_temp = active & ~(1U<<USBD_INTEN_EP0DATADONE_Pos);
            if(0 != active_temp)
            {
                event_nr = __CLZ(__RBIT(active_temp));
                if(event_nr >= USBD_INTEN_SOF_Pos)
                {
                    /* Get back the EP0Data done event */
                    event_nr = USBD_INTEN_EP0DATADONE_Pos;
                }
            }
        }
        #endif


        m_isr[event_nr]();
        active &= ~(1UL << event_nr);
    }

    usbd_dmareq_process();
#if NRF_DRV_USBD_PROTO1_FIX
    } while(0 != (enabled & m_simulated_events));
#endif
}

/** @} */
/** @} */

ret_code_t nrf_drv_usbd_init(nrf_drv_usbd_event_handler_t const event_handler)
{
    UNUSED_VARIABLE(usbd_ep_iso_capacity);

#if NRF_DRV_USBD_PROTO1_FIX
    nrf_drv_systick_init();
#endif
    if(NULL == event_handler)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    if( m_drv_state != NRF_DRV_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    nrf_drv_clock_hfclk_request(NULL);
    while (!nrf_drv_clock_hfclk_is_running())
    {
        /* Just waiting */
    }

    m_event_handler = event_handler;
    m_drv_state = NRF_DRV_STATE_INITIALIZED;

    uint8_t n;
    for(n=0; n<NRF_USBD_EPIN_CNT; ++n)
    {
        nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPIN(n);
        nrf_drv_usbd_ep_max_packet_size_set(ep, NRF_USBD_EPISO_CHECK(ep) ? (NRF_DRV_USBD_ISOSIZE / 2) : NRF_DRV_USBD_EPSIZE);
        usbd_drv_ep_state_t * p_state = ep_state_access(ep);
        p_state->status = NRF_USBD_EP_OK;
        p_state->transfer_left.size = 0;
        p_state->transfer_set.size  = 0;
    }
    for(n=0; n<NRF_USBD_EPOUT_CNT; ++n)
    {
        nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPOUT(n);
        nrf_drv_usbd_ep_max_packet_size_set(ep, NRF_USBD_EPISO_CHECK(ep) ? (NRF_DRV_USBD_ISOSIZE / 2) : NRF_DRV_USBD_EPSIZE);
        usbd_drv_ep_state_t * p_state = ep_state_access(ep);
        p_state->status = NRF_USBD_EP_OK;
        p_state->transfer_left.size = 0;
        p_state->transfer_set.size  = 0;
    }

    return NRF_SUCCESS;
}

ret_code_t nrf_drv_usbd_uninit(void)
{
    if( m_drv_state != NRF_DRV_STATE_INITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    nrf_drv_clock_lfclk_release();
    m_event_handler = NULL;
    m_drv_state = NRF_DRV_STATE_UNINITIALIZED;
    return NRF_SUCCESS;
}

void nrf_drv_usbd_enable(void)
{
    ASSERT(m_drv_state == NRF_DRV_STATE_INITIALIZED);

    /* Prepare for READY event receiving */
    nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);
    /* Enable the peripheral */
    nrf_usbd_enable();
    /* Waiting for peripheral to enable, this should take a few us */
    while(0 == (NRF_USBD_EVENTCAUSE_READY_MASK & nrf_usbd_eventcause_get()))
    {
        /* Empty loop */
    }
    nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);

    nrf_usbd_isosplit_set(NRF_USBD_ISOSPLIT_Half);

    m_ep_ready = (((1U<<NRF_USBD_EPIN_CNT) - 1U) << USBD_EPIN_BITPOS_0);
    m_ep_dma_waiting = 0;
    m_dma_pending    = 0;
    m_last_setup_dir = NRF_DRV_USBD_EPOUT0;

    m_drv_state = NRF_DRV_STATE_POWERED_ON;
}

void nrf_drv_usbd_disable(void)
{
    ASSERT(m_drv_state != NRF_DRV_STATE_UNINITIALIZED);

    /* Stop just in case */
    nrf_drv_usbd_stop();

    /* Disable all parts */
    nrf_usbd_int_disable(nrf_usbd_int_enable_get());
    nrf_usbd_disable();
    m_dma_pending = 0;
    m_drv_state = NRF_DRV_STATE_INITIALIZED;
}

void nrf_drv_usbd_start(bool enable_sof)
{
    ASSERT(m_drv_state == NRF_DRV_STATE_POWERED_ON);

    uint32_t ints_to_enable =
           NRF_USBD_INT_USBRESET_MASK     |
           NRF_USBD_INT_STARTED_MASK      |
           NRF_USBD_INT_ENDEPIN0_MASK     |
           NRF_USBD_INT_EP0DATADONE_MASK  |
           NRF_USBD_INT_ENDEPOUT0_MASK    |
           NRF_USBD_INT_USBEVENT_MASK     |
           NRF_USBD_INT_EP0SETUP_MASK     |
           NRF_USBD_INT_DATAEP_MASK       |
           NRF_USBD_INT_ACCESSFAULT_MASK;

   if(enable_sof || NRF_DRV_USBD_PROTO1_FIX)
   {
       ints_to_enable |= NRF_USBD_INT_SOF_MASK;
   }

   /* Enable all required interrupts */
   nrf_usbd_int_enable(ints_to_enable);

   /* Enable interrupt globally */
   usbd_int_enable();

   /* Enable pullups */
   nrf_usbd_pullup_enable();
}

void nrf_drv_usbd_stop(void)
{
    ASSERT(m_drv_state == NRF_DRV_STATE_POWERED_ON);

    /* Abort transfers */
    usbd_ep_abort_all();

    /* Disable pullups */
    nrf_usbd_pullup_disable();

    /* Disable interrupt globally */
    usbd_int_disable();
}

bool nrf_drv_usbd_is_initialized(void)
{
    return (m_drv_state >= NRF_DRV_STATE_INITIALIZED);
}

